podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/LTC0_MK82F25615.svd.xml
<!--
Devices using this peripheral: 
      MK82F25615
-->
      <peripheral>
         <?sourceFile "LTC0_MK82F25615" ?>
         <name>LTC0</name>
         <description>LP Trusted Cryptography</description>
         <groupName>LTC</groupName>
         <headerStructName>LTC</headerStructName>
         <baseAddress>0x400D1000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x8</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x10</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x18</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x30</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x34</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x48</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x58</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x60</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x68</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x80</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x88</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x90</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x98</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x200</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x300</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x310</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x340</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x348</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x4F0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x4F8</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x7C0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x7E0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x7F0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x800</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xA00</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC00</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xE00</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MD</name>
               <description>Mode Register (non-PKHA/non-RNG use)</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>ENC</name>
                     <description>This bit selects encryption or decryption</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Decrypt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Encrypt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ICV_TEST</name>
                     <description>ICV Checking / Test AES fault detection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AS</name>
                     <description>Algorithm State</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Update</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Initialize</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Finalize</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Initialize/Finalize</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AAI</name>
                     <description>Additional Algorithm information</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>ALG</name>
                     <description>Algorithm. This field specifies which algorithm is being selected</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00010000</name>
                           <description>AES</description>
                           <value>0b10000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00100000</name>
                           <description>DES</description>
                           <value>0b100000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00100001</name>
                           <description>3DES</description>
                           <value>0b100001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDPK</name>
               <description>Mode Register (PublicKey)</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>PKHA_MODE_LS</name>
                     <description>PKHA_MODE least significant 12 bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>PKHA_MODE_MS</name>
                     <description>PKHA_MODE most-significant 4 bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ALG</name>
                     <description>Algorithm. This field specifies which algorithm is being selected</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>PKHA</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>KS</name>
               <description>Key Size Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>KS</name>
                     <description>Key Size. This is the size of a Key measured in bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DS</name>
               <description>Data Size Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>DS</name>
                     <description>Data Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICVS</name>
               <description>ICV Size Register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>ICVS</name>
                     <description>ICV Size, in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COM</name>
               <description>Command Register</description>
               <addressOffset>0x30</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ALL</name>
                     <description>Reset All Internal Logic</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do Not Reset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset all CHAs in use by this CCB</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AES</name>
                     <description>Reset AESA. Writing a 1 to this bit resets the AES Accelerator core engine</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do Not Reset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset AES Accelerator</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DES</name>
                     <description>Reset DESA. Writing a 1 to this bit resets the DES Accelerator</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do Not Reset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset DES Accelerator</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PK</name>
                     <description>Reset PKHA. Writing a 1 to this bit resets the Public Key Hardware Accelerator</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do Not Reset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset Public Key Hardware Accelerator</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <description>Control Register</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>IM</name>
                     <description>Interrupt Mask.\nOnce this bit is set, it can only be cleared by hard reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt not masked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt masked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PDE</name>
                     <description>PKHA Register DMA Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA Request and Done signals disabled for the PKHA</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA Request and Done signals enabled for the PKHA</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IFE</name>
                     <description>Input FIFO DMA Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA Request and Done signals disabled for the Input FIFO</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA Request and Done signals enabled for the Input FIFO</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IFR</name>
                     <description>Input FIFO DMA Request Size</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA request size is 1 entry</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA request size is 4 entries</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OFE</name>
                     <description>Output FIFO DMA Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA Request and Done signals disabled for the Output FIFO</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA Request and Done signals enabled for the Output FIFO</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IFR" > <name>OFR</name> <description>Output FIFO DMA Request Size</description> <bitOffset>13</bitOffset> </field>
                  <field>
                     <name>IFS</name>
                     <description>Input FIFO Byte Swap.\n
Byte swap all data that is written to the Input FIFO</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do Not Byte Swap Data</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Byte Swap Data</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IFS" > <name>OFS</name> <description>Output FIFO Byte Swap</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="IFS" > <name>KIS</name> <description>Key Register Input Byte Swap</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="IFS" > <name>KOS</name> <description>Key Register Output Byte Swap</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="IFS" > <name>CIS</name> <description>Context Register Input Byte Swap</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="IFS" > <name>COS</name> <description>Context Register Output Byte Swap</description> <bitOffset>23</bitOffset> </field>
                  <field>
                     <name>KAL</name>
                     <description>Key Register Access Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Key Register is readable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Key Register is not readable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
