podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/LTC0_MK82F25615.svd.xml
            <register>
               <name>CW</name>
               <description>Clear Written Register</description>
               <addressOffset>0x40</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CM</name>
                     <description>Clear the Mode Register. Writing a one to this bit causes the Mode Register to be cleared</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDS</name>
                     <description>Clear the Data Size Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICV</name>
                     <description>Clear the ICV Size Register. Writing a one to this bit causes the ICV Size Register to be cleared</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCR</name>
                     <description>Clear the Context Register. Writing a one to this bit causes the Context Register to be cleared</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKR</name>
                     <description>Clear the Key Register</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKA</name>
                     <description>Clear the PKHA A Size Register</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKB</name>
                     <description>Clear the PKHA B Size Register</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKN</name>
                     <description>Clear the PKHA N Size Register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKE</name>
                     <description>Clear the PKHA E Size Register</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COF</name>
                     <description>Clear Output FIFO. Writing a 1 to this bit causes the Output FIFO to be cleared</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CIF</name>
                     <description>Clear Input FIFO. Writing a 1 to this bit causes the Input Data FIFO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STA</name>
               <description>Status Register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>AB</name>
                     <description>AESA Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>AESA Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>AESA Busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DB</name>
                     <description>DESA Busy</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DESA Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DESA Busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PB</name>
                     <description>PKHA Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PKHA Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PKHA Busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DI</name>
                     <description>Done Interrupt</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EI</name>
                     <description>Error Interrupt</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Not Error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Error Interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PKP</name>
                     <description>Public Key is Prime</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PKO</name>
                     <description>Public Key Operation is One</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PKZ</name>
                     <description>Public Key Operation is Zero</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ESTA</name>
               <description>Error Status Register</description>
               <addressOffset>0x4C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRID1</name>
                     <description>Error ID 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Mode Error</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Data Size Error, including PKHA N Register Size Error</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Key Size Error, including PKHA E Register Size Error</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>PKHA A Register Size Error</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>PKHA B Register Size Error</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Data Arrived out of Sequence Error</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>PKHA Divide by Zero Error</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>PKHA Modulus Even Error</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>DES Key Parity Error</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>ICV Check Failed</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Internal Hardware Failure</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>CCM AAD Size Error (either 1. AAD flag in B0 =1 and no AAD type provided, 2. AAD flag in B0 = 0 and AAD povided, or 3. AAD flag in B0 =1 and not enough AAD provided - expecting more based on AAD size.)</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>Invalid Crypto Engine Selected</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CL1</name>
                     <description>algorithms.\n
The algorithms field indicates which algorithm is asserting an error. Others reserved</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>General Error</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>AES</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>DES</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>Public Key</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>AADSZ</name>
               <description>AAD Size Register</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>AADSZ</name>
                     <description>AAD size in Bytes, mod 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AL</name>
                     <description>AAD Last. Only AAD data will be written into the Input FIFO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IVSZ</name>
               <description>IV Size Register</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>IVSZ</name>
                     <description>IV size in Bytes, mod 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>IL</name>
                     <description>IV Last. Only IV data will be written into the Input FIFO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPAMS</name>
               <description>DPA Mask Seed Register</description>
               <addressOffset>0x68</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DPAMS</name>
                     <description>Differential Power Analysis Mask Seed</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKASZ</name>
               <description>PKHA A Size Register</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>PKASZ</name>
                     <description>PKHA A Size. This is the size of the numeric value, in bytes, contained within the PKHA A Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKBSZ</name>
               <description>PKHA B Size Register</description>
               <addressOffset>0x88</addressOffset>
               <fields>
                  <field>
                     <name>PKBSZ</name>
                     <description>PKHA B Size. This is the size of the numeric value, in bytes, contained within the PKHA B Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKNSZ</name>
               <description>PKHA N Size Register</description>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>PKNSZ</name>
                     <description>PKHA N Size. This is the size of the numeric value, in bytes, contained within the PKHA N Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKESZ</name>
               <description>PKHA E Size Register</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>PKESZ</name>
                     <description>PKHA E Size. This is the size of the numeric value, in bytes, contained within the PKHA E Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>CTX%s</name>
               <description>Context Register</description>
               <addressOffset>0x100</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CTX</name>
                     <description>CTX</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
               <name>KEY%s</name>
               <description>Key</description>
               <addressOffset>0x200</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>KEY</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG4_DRNG_STATUS</name>
               <description>RNG4 DRNG Status</description>
               <addressOffset>0x300</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IF0</name>
                     <description>Instantiated Flag 0. State Handle 0 has been instantiated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IF1</name>
                     <description>Instantiated Flag 1. State Handle 1 has been instantiated</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PR0</name>
                     <description>Prediction Resistance State Handle 0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PR1</name>
                     <description>Prediction Resistance State Handle 1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF0</name>
                     <description>Test Flag State Handle 0. State Handle 0 has been instantiated as a test (deterministic) instance</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF1</name>
                     <description>Test Flag State Handle 1. State Handle 1 has been instantiated as a test (deterministic) instance</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRCODE</name>
                     <description>Error Code</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CE</name>
                     <description>Catastrophic Error</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>RNG4_DRNG_INTERVAL%s</name>
               <description>RNG4 DRNG Interval %s Register</description>
               <addressOffset>0x310</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RESINT0</name>
                     <description>This read-only register holds the Reseed Interval for State Handle 0</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
